[Killed] Block
product-api/app/product/domain.js:3:32
 const model = require('./model');
 
-async function findProducts () {
-  const products = await model.find({}, '-_id -__v');
-  return products;
-}
+async function findProducts () {}
 
 async function insertProduct (product) {

[Killed] Block
product-api/app/product/domain.js:8:40
   return products;
 }
 
-async function insertProduct (product) {
-  const newProduct = await model.create(product);
-  return newProduct;
-}
+async function insertProduct (product) {}
 
 async function findProduct (id) {

[Killed] Block
product-api/app/product/domain.js:13:33
   return newProduct;
 }
 
-async function findProduct (id) {
-  const product = await model.find({ id }, '-_id -__v');
-  return product || {};
-}
+async function findProduct (id) {}
 
 async function deleteProduct (id) {

[Killed] StringLiteral
product-api/app/product/domain.js:14:44
 }
 
 async function findProduct (id) {
-  const product = await model.find({ id }, '-_id -__v');
+  const product = await model.find({ id }, "");
   return product || {};
 }

[Killed] ConditionalExpression
product-api/app/product/domain.js:15:10
 
 async function findProduct (id) {
   const product = await model.find({ id }, '-_id -__v');
-  return product || {};
+  return true;
 }
 

[Killed] BinaryExpression
product-api/app/product/domain.js:15:10
 
 async function findProduct (id) {
   const product = await model.find({ id }, '-_id -__v');
-  return product || {};
+  return product && {};
 }
 

[Killed] Block
product-api/app/product/domain.js:18:35
   return product || {};
 }
 
-async function deleteProduct (id) {
-  await model.deleteOne({ id });
-}
+async function deleteProduct (id) {}
 
 module.exports = {

[Killed] ObjectLiteral
product-api/app/product/domain.js:19:25
 }
 
 async function deleteProduct (id) {
-  await model.deleteOne({ id });
+  await model.deleteOne({});
 }
 
