[Killed] StringLiteral
product-api/app/product/router.js:6:24
 const bodyParser = require('body-parser');
 const basicAuth = require('express-basic-auth');
 
-const domain = require('./domain');
+const domain = require("");
 
 router.get('/', async (req, res) => {

[Killed] Block
product-api/app/product/router.js:8:37
 
 const domain = require('./domain');
 
-router.get('/', async (req, res) => {
-  const products = await domain.findProducts();
-  res.status(httpStatus.OK).send(products);
-});
+router.get('/', async (req, res) => {});
 
 router.get('/:id', async (req, res) => {

[Killed] Block
product-api/app/product/router.js:13:40
   res.status(httpStatus.OK).send(products);
 });
 
-router.get('/:id', async (req, res) => {
-  const product = await domain.findProduct(req.params.id);
-  res.status(httpStatus.OK).send(product);
-});
+router.get('/:id', async (req, res) => {});
 
 router.post(

[Survived] StringLiteral
product-api/app/product/router.js:19:3
 });
 
 router.post(
-  '/',
+  "",
   basicAuth({
     users: { admin: 'supersecret' }

[Killed] ObjectLiteral
product-api/app/product/router.js:20:13
 
 router.post(
   '/',
-  basicAuth({
-    users: { admin: 'supersecret' }
-  }),
+  basicAuth({}),
   bodyParser.json(),
   async (req, res) => {

[Killed] StringLiteral
product-api/app/product/router.js:21:21
 router.post(
   '/',
   basicAuth({
-    users: { admin: 'supersecret' }
+    users: { admin: "" }
   }),
   bodyParser.json(),

[Timeout] Block
product-api/app/product/router.js:24:23
     users: { admin: 'supersecret' }
   }),
   bodyParser.json(),
-  async (req, res) => {
-    try {
-      const product = await domain.insertProduct(req.body);
-      res.status(httpStatus.CREATED).send(product);
-    } catch (error) {
-      res.status(httpStatus.INTERNAL_SERVER_ERROR).send(error);
-    }
-  }
+  async (req, res) => {}
 );
 

[Timeout] Block
product-api/app/product/router.js:25:9
   }),
   bodyParser.json(),
   async (req, res) => {
-    try {
-      const product = await domain.insertProduct(req.body);
-      res.status(httpStatus.CREATED).send(product);
-    } catch (error) {
+    try {} catch (error) {
       res.status(httpStatus.INTERNAL_SERVER_ERROR).send(error);
     }

[Killed] Block
product-api/app/product/router.js:28:21
     try {
       const product = await domain.insertProduct(req.body);
       res.status(httpStatus.CREATED).send(product);
-    } catch (error) {
-      res.status(httpStatus.INTERNAL_SERVER_ERROR).send(error);
-    }
+    } catch (error) {}
   }
 );

[Killed] ObjectLiteral
product-api/app/product/router.js:36:13
 
 router.delete(
   '/:id',
-  basicAuth({
-    users: { admin: 'supersecret' }
-  }),
+  basicAuth({}),
   async (req, res) => {
     await domain.deleteProduct(req.params.id);

[Killed] Block
product-api/app/product/router.js:39:23
   basicAuth({
     users: { admin: 'supersecret' }
   }),
-  async (req, res) => {
-    await domain.deleteProduct(req.params.id);
-    res.status(httpStatus.OK).send();
-  }
+  async (req, res) => {}
 );
 
